Microchip-MPLAB-Harmony/bootloader_apps_uart/apps/uart_bootloader/bootloader/pic32cm_sg00_curioisty_pro_trustzone/pic32cm_sg00/src/packs/PIC32CM5112SG00100_DFP/component/fcr.h
#define FCR_FFLTPAR_SECIN_Pos                 _UINT32_(0)                                          /* (FCR_FFLTPAR) The Single Error Parity bits from Flash Position */
#define FCR_FFLTPAR_SECIN_Msk                 (_UINT32_(0x1FF) << FCR_FFLTPAR_SECIN_Pos)           /* (FCR_FFLTPAR) The Single Error Parity bits from Flash Mask */
#define FCR_FFLTPAR_SECIN(value)              (FCR_FFLTPAR_SECIN_Msk & (_UINT32_(value) << FCR_FFLTPAR_SECIN_Pos)) /* Assignment of value for SECIN in the FCR_FFLTPAR register */
#define FCR_FFLTPAR_DEDIN_Pos                 _UINT32_(15)                                         /* (FCR_FFLTPAR) The Overall Parity from Flash Position */
#define FCR_FFLTPAR_DEDIN_Msk                 (_UINT32_(0x1) << FCR_FFLTPAR_DEDIN_Pos)             /* (FCR_FFLTPAR) The Overall Parity from Flash Mask */
#define FCR_FFLTPAR_DEDIN(value)              (FCR_FFLTPAR_DEDIN_Msk & (_UINT32_(value) << FCR_FFLTPAR_DEDIN_Pos)) /* Assignment of value for DEDIN in the FCR_FFLTPAR register */
#define FCR_FFLTPAR_SECOUT_Pos                _UINT32_(16)                                         /* (FCR_FFLTPAR) The Calculated Single Error Parity bits Position */
#define FCR_FFLTPAR_SECOUT_Msk                (_UINT32_(0x1FF) << FCR_FFLTPAR_SECOUT_Pos)          /* (FCR_FFLTPAR) The Calculated Single Error Parity bits Mask */
#define FCR_FFLTPAR_SECOUT(value)             (FCR_FFLTPAR_SECOUT_Msk & (_UINT32_(value) << FCR_FFLTPAR_SECOUT_Pos)) /* Assignment of value for SECOUT in the FCR_FFLTPAR register */
#define FCR_FFLTPAR_DEDOUT_Pos                _UINT32_(31)                                         /* (FCR_FFLTPAR) The Calculated Overall Parity used in Double Error Detection Position */
#define FCR_FFLTPAR_DEDOUT_Msk                (_UINT32_(0x1) << FCR_FFLTPAR_DEDOUT_Pos)            /* (FCR_FFLTPAR) The Calculated Overall Parity used in Double Error Detection Mask */
#define FCR_FFLTPAR_DEDOUT(value)             (FCR_FFLTPAR_DEDOUT_Msk & (_UINT32_(value) << FCR_FFLTPAR_DEDOUT_Pos)) /* Assignment of value for DEDOUT in the FCR_FFLTPAR register */
#define FCR_FFLTPAR_Msk                       _UINT32_(0x81FF81FF)                                 /* (FCR_FFLTPAR) Register Mask  */


/* -------- FCR_FFLTSYN : (FCR Offset: 0x64) ( R/ 32) Flash ECC Fault Syndrome REGISTER -------- */
#define FCR_FFLTSYN_RESETVALUE                _UINT32_(0x00)                                       /*  (FCR_FFLTSYN) Flash ECC Fault Syndrome REGISTER  Reset Value */

#define FCR_FFLTSYN_SECSYN_Pos                _UINT32_(0)                                          /* (FCR_FFLTSYN) Single Error Correction Syndrome Position */
#define FCR_FFLTSYN_SECSYN_Msk                (_UINT32_(0x1FF) << FCR_FFLTSYN_SECSYN_Pos)          /* (FCR_FFLTSYN) Single Error Correction Syndrome Mask */
#define FCR_FFLTSYN_SECSYN(value)             (FCR_FFLTSYN_SECSYN_Msk & (_UINT32_(value) << FCR_FFLTSYN_SECSYN_Pos)) /* Assignment of value for SECSYN in the FCR_FFLTSYN register */
#define FCR_FFLTSYN_DEDSYN_Pos                _UINT32_(15)                                         /* (FCR_FFLTSYN) DED Syndrome Position */
#define FCR_FFLTSYN_DEDSYN_Msk                (_UINT32_(0x1) << FCR_FFLTSYN_DEDSYN_Pos)            /* (FCR_FFLTSYN) DED Syndrome Mask */
#define FCR_FFLTSYN_DEDSYN(value)             (FCR_FFLTSYN_DEDSYN_Msk & (_UINT32_(value) << FCR_FFLTSYN_DEDSYN_Pos)) /* Assignment of value for DEDSYN in the FCR_FFLTSYN register */
#define   FCR_FFLTSYN_DEDSYN_0_Val            _UINT32_(0x0)                                        /* (FCR_FFLTSYN) Calculated Overall Parity Concurs with Read Overall Parity  */
#define   FCR_FFLTSYN_DEDSYN_1_Val            _UINT32_(0x1)                                        /* (FCR_FFLTSYN) Calculated Overall Parity Differs from Read Overall Parity  */
#define FCR_FFLTSYN_DEDSYN_0                  (FCR_FFLTSYN_DEDSYN_0_Val << FCR_FFLTSYN_DEDSYN_Pos) /* (FCR_FFLTSYN) Calculated Overall Parity Concurs with Read Overall Parity Position */
#define FCR_FFLTSYN_DEDSYN_1                  (FCR_FFLTSYN_DEDSYN_1_Val << FCR_FFLTSYN_DEDSYN_Pos) /* (FCR_FFLTSYN) Calculated Overall Parity Differs from Read Overall Parity Position */
#define FCR_FFLTSYN_DSERR_Pos                 _UINT32_(16)                                         /* (FCR_FFLTSYN) Double Error Detected &amp; Single Error Corrected Position */
#define FCR_FFLTSYN_DSERR_Msk                 (_UINT32_(0x3) << FCR_FFLTSYN_DSERR_Pos)             /* (FCR_FFLTSYN) Double Error Detected &amp; Single Error Corrected Mask */
#define FCR_FFLTSYN_DSERR(value)              (FCR_FFLTSYN_DSERR_Msk & (_UINT32_(value) << FCR_FFLTSYN_DSERR_Pos)) /* Assignment of value for DSERR in the FCR_FFLTSYN register */
#define   FCR_FFLTSYN_DSERR_NONE_Val          _UINT32_(0x0)                                        /* (FCR_FFLTSYN) No Errors  */
#define   FCR_FFLTSYN_DSERR_SINGLE_Val        _UINT32_(0x1)                                        /* (FCR_FFLTSYN) Single Error Corrected  */
#define   FCR_FFLTSYN_DSERR_DOUBLE_10_Val     _UINT32_(0x2)                                        /* (FCR_FFLTSYN) Double Error Detected  */
#define   FCR_FFLTSYN_DSERR_DOUBLE_11_Val     _UINT32_(0x3)                                        /* (FCR_FFLTSYN) Double Error Detected  */
#define FCR_FFLTSYN_DSERR_NONE                (FCR_FFLTSYN_DSERR_NONE_Val << FCR_FFLTSYN_DSERR_Pos) /* (FCR_FFLTSYN) No Errors Position */
#define FCR_FFLTSYN_DSERR_SINGLE              (FCR_FFLTSYN_DSERR_SINGLE_Val << FCR_FFLTSYN_DSERR_Pos) /* (FCR_FFLTSYN) Single Error Corrected Position */
#define FCR_FFLTSYN_DSERR_DOUBLE_10           (FCR_FFLTSYN_DSERR_DOUBLE_10_Val << FCR_FFLTSYN_DSERR_Pos) /* (FCR_FFLTSYN) Double Error Detected Position */
#define FCR_FFLTSYN_DSERR_DOUBLE_11           (FCR_FFLTSYN_DSERR_DOUBLE_11_Val << FCR_FFLTSYN_DSERR_Pos) /* (FCR_FFLTSYN) Double Error Detected Position */
#define FCR_FFLTSYN_CERR_Pos                  _UINT32_(18)                                         /* (FCR_FFLTSYN) ECC Control bit Error Position */
#define FCR_FFLTSYN_CERR_Msk                  (_UINT32_(0x1) << FCR_FFLTSYN_CERR_Pos)              /* (FCR_FFLTSYN) ECC Control bit Error Mask */
#define FCR_FFLTSYN_CERR(value)               (FCR_FFLTSYN_CERR_Msk & (_UINT32_(value) << FCR_FFLTSYN_CERR_Pos)) /* Assignment of value for CERR in the FCR_FFLTSYN register */
#define   FCR_FFLTSYN_CERR_NONE_Val           _UINT32_(0x0)                                        /* (FCR_FFLTSYN) No Control bit Error (ECCSTAT either 111 or 000)  */
#define   FCR_FFLTSYN_CERR_SINGLE_Val         _UINT32_(0x1)                                        /* (FCR_FFLTSYN) Single Control Bit Error  */
#define FCR_FFLTSYN_CERR_NONE                 (FCR_FFLTSYN_CERR_NONE_Val << FCR_FFLTSYN_CERR_Pos)  /* (FCR_FFLTSYN) No Control bit Error (ECCSTAT either 111 or 000) Position */
#define FCR_FFLTSYN_CERR_SINGLE               (FCR_FFLTSYN_CERR_SINGLE_Val << FCR_FFLTSYN_CERR_Pos) /* (FCR_FFLTSYN) Single Control Bit Error Position */
#define FCR_FFLTSYN_CTLSTAT_Pos               _UINT32_(24)                                         /* (FCR_FFLTSYN) Parity vs ECC Control Status Position */
#define FCR_FFLTSYN_CTLSTAT_Msk               (_UINT32_(0x7) << FCR_FFLTSYN_CTLSTAT_Pos)           /* (FCR_FFLTSYN) Parity vs ECC Control Status Mask */
#define FCR_FFLTSYN_CTLSTAT(value)            (FCR_FFLTSYN_CTLSTAT_Msk & (_UINT32_(value) << FCR_FFLTSYN_CTLSTAT_Pos)) /* Assignment of value for CTLSTAT in the FCR_FFLTSYN register */
#define   FCR_FFLTSYN_CTLSTAT_USEDECC_0_Val   _UINT32_(0x0)                                        /* (FCR_FFLTSYN) Calculation used ECC (i.e. programming used quad write)  */
#define   FCR_FFLTSYN_CTLSTAT_USEDECC_1_Val   _UINT32_(0x1)                                        /* (FCR_FFLTSYN) Calculation used ECC (i.e. programming used quad write)  */
#define   FCR_FFLTSYN_CTLSTAT_USEDECC_10_Val  _UINT32_(0x2)                                        /* (FCR_FFLTSYN) Calculation used ECC (i.e. programming used quad write)  */
#define   FCR_FFLTSYN_CTLSTAT_USEDPARITY_11_Val _UINT32_(0x3)                                        /* (FCR_FFLTSYN) Calculation used Parity (i.e. programming used single write)  */
#define   FCR_FFLTSYN_CTLSTAT_USEDECC_100_Val _UINT32_(0x4)                                        /* (FCR_FFLTSYN) Calculation used ECC (i.e. programming used quad write)  */
#define   FCR_FFLTSYN_CTLSTAT_USEDPARITY_101_Val _UINT32_(0x5)                                        /* (FCR_FFLTSYN) Calculation used Parity (i.e. programming used single write)  */
#define   FCR_FFLTSYN_CTLSTAT_USEDPARITY_110_Val _UINT32_(0x6)                                        /* (FCR_FFLTSYN) Calculation used Parity (i.e. programming used single write)  */
#define   FCR_FFLTSYN_CTLSTAT_USEDPARITY_111_Val _UINT32_(0x7)                                        /* (FCR_FFLTSYN) Calculation used Parity (i.e. programming used single write)  */
#define FCR_FFLTSYN_CTLSTAT_USEDECC_0         (FCR_FFLTSYN_CTLSTAT_USEDECC_0_Val << FCR_FFLTSYN_CTLSTAT_Pos) /* (FCR_FFLTSYN) Calculation used ECC (i.e. programming used quad write) Position */
#define FCR_FFLTSYN_CTLSTAT_USEDECC_1         (FCR_FFLTSYN_CTLSTAT_USEDECC_1_Val << FCR_FFLTSYN_CTLSTAT_Pos) /* (FCR_FFLTSYN) Calculation used ECC (i.e. programming used quad write) Position */
#define FCR_FFLTSYN_CTLSTAT_USEDECC_10        (FCR_FFLTSYN_CTLSTAT_USEDECC_10_Val << FCR_FFLTSYN_CTLSTAT_Pos) /* (FCR_FFLTSYN) Calculation used ECC (i.e. programming used quad write) Position */
#define FCR_FFLTSYN_CTLSTAT_USEDPARITY_11     (FCR_FFLTSYN_CTLSTAT_USEDPARITY_11_Val << FCR_FFLTSYN_CTLSTAT_Pos) /* (FCR_FFLTSYN) Calculation used Parity (i.e. programming used single write) Position */
#define FCR_FFLTSYN_CTLSTAT_USEDECC_100       (FCR_FFLTSYN_CTLSTAT_USEDECC_100_Val << FCR_FFLTSYN_CTLSTAT_Pos) /* (FCR_FFLTSYN) Calculation used ECC (i.e. programming used quad write) Position */
#define FCR_FFLTSYN_CTLSTAT_USEDPARITY_101    (FCR_FFLTSYN_CTLSTAT_USEDPARITY_101_Val << FCR_FFLTSYN_CTLSTAT_Pos) /* (FCR_FFLTSYN) Calculation used Parity (i.e. programming used single write) Position */
#define FCR_FFLTSYN_CTLSTAT_USEDPARITY_110    (FCR_FFLTSYN_CTLSTAT_USEDPARITY_110_Val << FCR_FFLTSYN_CTLSTAT_Pos) /* (FCR_FFLTSYN) Calculation used Parity (i.e. programming used single write) Position */
#define FCR_FFLTSYN_CTLSTAT_USEDPARITY_111    (FCR_FFLTSYN_CTLSTAT_USEDPARITY_111_Val << FCR_FFLTSYN_CTLSTAT_Pos) /* (FCR_FFLTSYN) Calculation used Parity (i.e. programming used single write) Position */
#define FCR_FFLTSYN_PERR_Pos                  _UINT32_(28)                                         /* (FCR_FFLTSYN) Per Word (n=3:0) Parity Error Status Position */
#define FCR_FFLTSYN_PERR_Msk                  (_UINT32_(0xF) << FCR_FFLTSYN_PERR_Pos)              /* (FCR_FFLTSYN) Per Word (n=3:0) Parity Error Status Mask */
#define FCR_FFLTSYN_PERR(value)               (FCR_FFLTSYN_PERR_Msk & (_UINT32_(value) << FCR_FFLTSYN_PERR_Pos)) /* Assignment of value for PERR in the FCR_FFLTSYN register */
#define   FCR_FFLTSYN_PERR_NONE_Val           _UINT32_(0x0)                                        /* (FCR_FFLTSYN) No Parity Error on Word n  */
#define   FCR_FFLTSYN_PERR_ERROR_Val          _UINT32_(0x1)                                        /* (FCR_FFLTSYN) Parity Error on Word n  */
#define FCR_FFLTSYN_PERR_NONE                 (FCR_FFLTSYN_PERR_NONE_Val << FCR_FFLTSYN_PERR_Pos)  /* (FCR_FFLTSYN) No Parity Error on Word n Position */
#define FCR_FFLTSYN_PERR_ERROR                (FCR_FFLTSYN_PERR_ERROR_Val << FCR_FFLTSYN_PERR_Pos) /* (FCR_FFLTSYN) Parity Error on Word n Position */
#define FCR_FFLTSYN_Msk                       _UINT32_(0xF70781FF)                                 /* (FCR_FFLTSYN) Register Mask  */


/* -------- FCR_CRP : (FCR Offset: 0x68) (R/W 32) CFM Page Read Protection REGISTER (CFM8) -------- */
#define FCR_CRP_RESETVALUE                    _UINT32_(0xC20000)                                   /*  (FCR_CRP) CFM Page Read Protection REGISTER (CFM8)  Reset Value */

